#+TITLE: Photo Embeddings and Semantic Search
#+SETUPFILE: ./common-headers.org

* Setup
First, ensure we have the required model and directories.

#+begin_src shell :llm t :results file :file ../data/photo-setup.txt :tangle ../data/photo-setup.sh
# Register the model
llm sentence-transformers register all-MiniLM-L6-v2
#+end_src

#+begin_src shell :llm f
# Verify directories
ls -la ../data/images/jwalsh_*  2>/dev/null | wc -l  || echo "Photo directory not found"
ls -la ../data/semantic-photos 2>/dev/null || echo "Semantic photos directory not found"
#+end_src

#+RESULTS:
: 29
: Semantic photos directory not found


